phil-huxford/AIX-chpwdage/files/chpwdage.1
.TH CHPWDAGE 1 "17 August 2021"
.SH NAME
.B chpwdage 
\- is be used to add a 
.B ADMCHG 
flag to user accounts. 

.SH INTRODUCTION
.B chpwdage
is be used to add a 
.B ADMCHG
flag to users in the /etc/security/passwd file.
This flag does not change a users password, but the user
will be prompt to change their password next time they log in.
This can apply to all users immediately, if 
there is a cybersecurity event for example, or you
can specify a UNIX timestamp and any password that
was changed before that timestamp will be flagged to be reset.

You can choose to exclude system users (if you maintain a list of them).

.SH FLAGS
This script will run as normal if it is run without any
flags
.B unless
you maintain a list of system users. If you maintain a list
of system users and do not specify a flag, you will be asked 
if you want to include them.

The
.B \-h
flag will display the help file (this man page).

The
.B \-i
flag is used to 
.B include 
system users in the list of users to be flagged.
If you use this flag and do not have a list of system users,
you will get the following error:

"No system user list found, please see the man page."

The
.B \-e
flag is used to 
.B exclude 
system users from the list of users to be flagged.
If you use this flag and do not have a list of system users,
you will get the following error:

"No system user list found, please see the man page."



.SH FILES
.B Logs 

The logs for this script are located: /var/log/chpwdage/

.B System_user_list 

The system user list is located: 

.B chpwdage

This script is located: /usr/bin/chpwdage

.B man

This man page is located: /usr/share/man/man1/chpwdage.1


.SH AUTHOR
Phil Huxford, The Iowa Clinic
